export const text = {
  redeem: {
    title: '积分兑换',
    content: `
      一、兑换码获取方式有多种:
      1.1 参与联名合作商家的相关活动获得。
      1.2 关注 Norma AI 公众号, 不定期参与 Norma AI 官方活动获得。
      二、兑换码使用注意事项：
      2.1 兑换码使用后立即生效, 如遇到兑换码兑换无效或显示过期, 请立即添加群聊并联系客服。
      2.2 Norma AI 团队在法律规定范围内享有本规则的解释权。
    `,
  },
  termsAndConditions: {
    title: "用户协议",
    content: `
      一、服务条款的接受与修改
      1.1 本应用（以下简称"我们"）在此特别提醒您（用户）在注册成为用户之前, 请认真阅读本《用户协议》（以下简称"协议"）, 确保您充分理解本协议中各条款。您点击"同意并继续"按钮后, 本协议即构成对双方有约束力的法律文件。
      1.2 我们有权在必要时修改本协议的条款, 该等修改一经在本应用上公布即有效替代原来的协议条款。您可以随时登录查阅最新协议。您有义务关注并阅读最新版的协议及应用公告。如果您不同意更新后的协议, 可以且应立即停止接受应用依据本协议提供的服务。如果您继续使用本应用提供的服务, 即视为同意更新后的协议。

      二、用户注册
      2.1 用户在使用本应用前需要注册一个用户帐号。用户应保证注册时提供自己的真实信息。用户应保证提供的帐号名称、头像和个人简介等注册信息中, 不得出现违法和不良信息, 且用户不得以网络诈骗、恶意注册等方式扰乱本应用的正常秩序。
      2.2 用户保证不以他人资料进行注册或认证, 如用户违反上述提述, 我们有权立即停止提供服务, 注销该用户账号, 并由用户独自承担由此产生的一切法律责任。

      三、用户的权利和义务
      3.1 用户有权根据本协议的规定以及本应用上发布的相关规则, 利用本应用查询商品信息、进行商品购买、参加本应用的有关活动以及使用其他信息服务。
      3.2 用户应当遵守本协议的各项条款, 正确、适当地使用本服务, 如用户违反本协议中的任何条款, 我们有权依据协议终止对违约用户提供服务。同时, 我们保留在任何时候删除任何内容以及任何时候暂停、终止或限制用户对服务的使用的权利。
      3.3 用户不得利用本应用进行任何可能对互联网正常运转造成不利影响的行为, 也不得利用本应用进行任何不利于我们的行为。

      四、隐私保护
      我们承诺在我们的业务活动中遵守严格的系统和程序, 保护您的个人信息。我们会通过加密技术、匿名处理等手段保护您的个人信息, 未经您的同意, 我们不会将这些信息向无关第三方披露。

      五、法律适用和管辖
      本协议的订立、执行和解释及争议的解决均应适用中国法律。如双方就本协议内容或其执行发生任何争议, 双方应尽量友好协商解决。协商不成时, 任何一方可向我方所在地的人民法院提起诉讼。

      六、其他
      6.1 我们对本协议拥有最终的解释权。
      6.2 如您对本协议或本服务有任何问题, 您可以通过本应用公布的联系方式与我们联系。
    `,
  },
  privacyPolicy: {
    title: "隐私政策",
    content: `
      应用隐私政策（以下简称"本政策"）旨在保护用户的个人信息, 确保用户在使用我们的应用程序、网站和服务时能够了解我们如何收集、使用和保护用户的个人信息。请在使用我们的应用程序或服务之前仔细阅读本政策。

      一、信息收集
      我们可能会收集以下类型的信息：
      1.1 用户提供的信息：当用户注册账户、使用服务或与我们互动时, 可能需要提供一些个人信息, 如姓名、电子邮件地址、电话号码、地址等。
      1.2 自动收集的信息：当用户使用我们的服务时, 我们可能会自动收集一些信息, 如设备信息、操作系统、IP地址、访问时间、浏览器类型和语言等。
      1.3 第三方提供的信息：我们可能会从与我们合作的第三方获取用户的个人信息, 例如社交媒体平台。

      二、信息使用
      我们可能会将收集到的信息用于以下目的：
      2.1 提供、维护和改进我们的服务。
      2.2 处理用户的注册和登录请求。
      2.3 与用户进行沟通, 回应用户的问题和评论。
      2.4 进行市场营销活动, 例如向用户发送有关产品和服务的信息。
      2.5 保护我们和用户的权益, 包括检测、调查和防止欺诈、侵权或其他非法活动。

      三、信息分享
      我们可能会与以下各方共享用户的个人信息：
      3.1 为了完成服务目的而与我们的关联公司、合作伙伴和服务提供商共享。
      3.2 根据法律法规要求或应政府部门的要求提供。
      3.3 在涉及合并、收购或出售资产的情况下, 可能与相关交易方共享。

      四、信息保护
      我们采取合理的安全措施来保护用户的个人信息, 包括使用加密技术、访问控制等措施。但请注意, 互联网上没有任何一种传输或存储方法是绝对安全的。

      五、用户权利
      用户有权访问、更正、删除和限制处理其个人信息。用户还可以随时撤回同意并要求我们停止处理其个人信息。

      六、儿童隐私
      我们的服务不针对未满13岁的儿童。如果我们发现收集了13岁以下儿童的个人信息, 我们将采取措施删除这些信息。

      七、改变本政策
      我们可能会不时更新本政策。如有更改, 我们将在相关页面上发布新的政策, 并在适当的情况下通知用户。请定期查看本政策以了解我们如何保护用户的个人信息。

      八、联系我们
      如果用户对本政策有任何疑问或意见, 请通过以下方式与我们联系
      邮箱: 10e9928a@gmail.com
    `,
  },
  pointsDetails: {
    title: "积分细则",
    content: `
      一、积分定义及用途
      积分是我们应用内的虚拟货币, 用户可以通过完成特定任务或充值购买来获取积分, 进而兑换各种权益和奖励。但请注意, 积分仅在本应用内有效, 且无法转让、提现或兑换为现金。

      二、积分获取方式
      2.1 新注册用户奖励: 为了欢迎新用户的加入, 我们将为新注册用户提供一定积分作为注册奖励。
      2.2 每日签到积分: 为了鼓励用户的活跃参与, 用户每日登录应用并完成签到, 每次签到可获得一定积分。
      2.3 广告观看积分: 用户每日可选择观看激励广告以获取积分, 每次观看可获得一定积分。
      2.3 邀请用户积分: 用户可以通过邀请新用户以获取积分, 每次成功邀请可获得一定积分（新用户体验任一功能即为有效用户）。
      2.4 充值购买积分: 用户也可以选择直接充值购买积分, 具体购买方式和价格请参考《积分购买细则》。

      三、积分使用须知
      3.1 积分使用原则: 请合理使用积分, 严格遵守应用的使用规则和用户协议, 任何违规行为都可能导致积分被扣除或账号被封禁。
      3.2 积分规则变动: 我们保留对积分规则的最终解释权, 并有权根据运营情况进行调整和变更, 以适应市场需求。任何变动我们将提前通知用户。
      3.3 咨询与帮助: 如果您对积分有任何疑问或者遇到任何问题, 都可以随时联系我们的客服支持, 我们将尽快为您提供帮助和解答。
    `,
  },
  faceswapTips: {
    content: `
      温馨提示：
      1、个人头像照片栏最多 10 个, 超出可长按进行删除。
      2、图片换脸消耗 5 积分/次, 免费通道 5 星好评永久免费。
      3、视频换脸消耗 0.5 积分/秒, 高清修复消耗 0.5 积分/秒。
      4、请勿上传含有暴力、色情、恶心、恐怖等不良内容的图片或视频, 以免触犯法律法规, 影响他人心情。
      5、请勿将他人的照片用于恶意换脸, 侵犯他人的隐私权和名誉权。在换脸前, 请确保已经征得对方的同意。
      6、请勿将换脸后的图片或视频用于商业用途, 以免产生法律纠纷。
      7、请勿将换脸后的图片或视频用于诽谤、诬陷、恶搞他人, 以免触犯法律法规。
      8、请勿上传涉及国家机密、危害国家安全、损害民族团结、破坏宗教和谐等违法违规内容的图片或视频。
      `,
  },
  paintingTips: {
    content: `
      温馨提示：
      1、AI绘画消耗 5 积分/次。
      2、请勿制作含有暴力、色情、恶心、恐怖等不良内容的图片或视频, 以免触犯法律法规, 影响他人心情。
      3、请勿制作侵犯他人的隐私权和名誉权的照片或者视频。
      4、请勿将制作的图片或视频用于商业用途, 以免产生法律纠纷。
      5、请勿将制作的图片或视频用于诽谤、诬陷、恶搞他人, 以免触犯法律法规。
      6、请勿制作涉及国家机密、危害国家安全、损害民族团结、破坏宗教和谐等违法违规内容的图片或视频。
      `,
  },
  inPaintingTips: {
    content: `
      温馨提示：
      1、视频去字幕（水印）消耗 0.5 积分/秒。
      使用方法：
      1、选择视频
      2、选择字幕区域
      3、一键去除字幕
      `,
  },
  commissionTips: {
    content: `
      温馨提示：
      1、被邀请的用户购买积分, 即可获取实际支付金额对应比例的佣金返利。
      2、提现金额收取0.10%的提现手续费, 最少为0.5元。
      3、提现金额次日18点到账, 节假日顺延。
      4、提现前请检查支付宝账号和姓名。
      5、提现金额小于30元时, 每月1号可申请提现; 提现金额大于30元时, 可随时提现。
      `,
  },
  sVideoDownTips: {
    content: `
      使用教程：
      1、打开短视频APP点击【分享】按钮。
      2、找到【复制链接】点击。
      3、粘贴到上方输入框中点击下载即可。
      4、视频归平台及作者所有, 本应用不储存任何视频和图片。
      5、请勿将下载的图片或视频用于商业用途, 以免产生法律纠纷。
      `,
  },
  configTips: {
    content: `
      使用教程：
      1、上述参数一次设置长期有效, 指定脸参数仅当次有效。
      2、通过调节上述参数实现更完美的换脸效果, 所有参数均不建议调节为最值, 适度最好, 如无特殊需求建议使用默认值。
      3、面部高清修复用于解决面部模糊问题, 长视频或者视频本身模糊建议关闭。
      4、面部高清修复参数用于调节面部高清修复程度, 值越大越高清。
      5、人脸检测参数用于识别目标脸, 如果转场较多来回闪脸可适当降低, 过低也会导致物体被识别为脸。
      6、模版融合参数用于调节换脸效果, 值越大越像模版, 但同时也会降低自然度。
      7、高级优化为 beta 体验功能, 对换脸效果进行大幅优化。
      8、换脸默认选择最大的脸进行换脸, 打开指定脸开关可以从左往右选择需要指定换第几个脸型, 该功能还在持续优化中。
      9、更多换脸参数还在开发中, 敬请期待。
      `,
  },
  commissionPlan: {
    //#ifdef MP-WEIXIN
    content: `
      高佣方案：
      1、其他 AI 换脸话题下面评论区评论本应用。
      2、达人写推广文案进行推广, 推荐平台包括且不限于抖音、视频号、QQ等。
      3、其他类似 AI 换脸相关群里进行分享。
      4、更多合作方案联系 10e9928a@gmail.com。
      `,
    //#endif
    //#ifdef MP-KUAISHOU
    // @ts-ignore
    content: `
      高佣方案：
      1、其他 AI 换脸话题下面评论区评论本应用。
      2、其他类似 AI 换脸相关群里进行分享。
      3、更多合作方案联系 10e9928a@gmail.com。
      `,
    //#endif
  },
} as any;
